Revit 2027 API
NurbsSurfaceData.GetNumberOfKnotsU Method
 Get the number of knots in the u-direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfKnotsU()
Public Function GetNumberOfKnotsU As Integer
public:
int GetNumberOfKnotsU()
member GetNumberOfKnotsU : unit -> int
Return Value
Int32
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace